#1.请将 "1,2,3"，变成 ["1","2","3"]
origin = "1,2,3"
target = origin.split(',')

#test
print(target)

#-------------------------------------------------------------------
#2.使用Python copy一个文件，从a目录,copy文件到b目录
from pathlib import Path

file_from = Path(input('>>>输入origin文件路径'))
path_to = Path(input('>>>输入target目录'))

with open(file_from,'r') as f_from:
    with open(  path_to/file_from.name,'w' ) as f_to:
        f_to.write(f_from.read())

#-------------------------------------------------------------------
#3.以下代码输出什么，请解释原因(写到问题下方):

li = [ [ ] ] * 5 # 得到列表: [[],[],[],[],[]], 这里复制的是列表的引用, 等于将空列表的地址复制了5份, 其实指向的是同一个数据

li[0].append(10) # 每当改变这个地址指向的内容, 其他引用也发生改变, 其实背后的原理是数据只有一份, 地址复制了5份
print(li) #输出 [[10], [10], [10], [10], [10]]

li[1].append(20) # 同理
print(li) #输出 [[10, 20], [10, 20], [10, 20], [10, 20], [10, 20]]

li.append(30) # 此处是在外层列表添加新的元素30, 与内层列表无关
print(li) #输出 [[10, 20], [10, 20], [10, 20], [10, 20], [10, 20], 30]



"""
(0 + 0)


    很好！
"""