# 【本周第8周作业如下，请同学们按时完成哦】：
# 1、请将 "1,2,3"，变成 ["1","2","3"]
"1, 2, 3".split(',')
# 2、使用Python copy一个文件，从a目录,copy文件到b目录
with open('D:\\b\\a.txt') as f:
    t = str(f.readlines()[0])
with open('D:\\a\\b.txt', 'w')as f:
    f.write(t)
# 3、以下代码输出什么，请解释原因(写到问题下方):
# li = [ [ ] ] * 5
# li[0].append(10)          
# 给列表li[0]添加元素10，但[ [ ] ]*5后，li[0]~li[4]指向的地址是同一个地址
# print(li)
# li[1].append(20)
# print(li)
# li.append(30) # 给列表li追加30，直接追加
# print(li)
# out: [[10], [10], [10], [10], [10]]
#      [[10, 20], [10, 20], [10, 20], [10, 20], [10, 20]]
#      [[10, 20], [10, 20], [10, 20], [10, 20], [10, 20], 30]
